CSI API ETABS v1

# cDStEurocode_3_2005 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDStEurocode_3_2005

    Public Interface cDStEurocode_3_2005

    Dim instance As cDStEurocode_3_2005

    public interface class cDStEurocode_3_2005

    type cDStEurocode_3_2005 =  interface end

The cDStEurocode_3_2005 type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetOverwrite|  Retrieves the value
of a steel design overwrite item
|
GetPreference|  Retrieves the
value of a steel design preference item.
|
SetOverwrite|  Sets the value of a
steel design overwrite item
|
SetPreference|  Sets the value of
a steel design preference item.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com